--TODO триггеры
-- Запись 1
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (1, 'Полосатые преступники', 'Пьяные еноты в Германии поедают домашних животных забираясь в чужие квартиры.', '2023-08-16', '2023-08-16', 1, NULL);

-- Запись 2
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (2, 'Майки для жадных в Португалии', 'McDonald’s в Португалии запустил линию футболок для тех, кто не хочет делиться мороженым Макфлури с друзьями.', '2023-08-17', '2023-08-17', 2, NULL);

-- Запись 3
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (3, 'Станция "Луна-25" сделала первый снимок поверхности спутника Земли.', 'Автоматическая станция, совершающая полёт по круговой орбите искусственного спутника Луны, провела съемку лунной поверхности телевизионными камерами комплекса СТС-Л.', '2023-08-17', '2023-08-17', 3, NULL);

-- Запись 4
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (4, 'Новый температурный рекорд', 'В Турции в провинции Эскишехир зафиксировали новый температурный рекорд — воздух прогрелся почти до +49,5 градусов', '2023-08-16', '2023-08-16', 4, NULL);

-- Запись 5
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (5, 'Пересаженные человеку почки свиньи прижились и впервые нормально функционируют', 'Ученым из Университета Алабамы удалось провести успешную операцию по замене обеих почек человека генетически модифицированными органами свиньи', '2023-08-17', '2023-08-17', 5, NULL);

-- Запись 6
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (6, 'Колонизаторы окрестностей Минска', 'Медведей недавно вновь видели недалеко от Минска. На этот раз в деревнях Марьяливо и Боровляны.', '2023-08-17', '2023-08-17', 6, NULL);

-- Запись 7
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (7, 'Необычное мороженое из Кобрина', 'Шоколадное мороженое «Любимый Брест» со вкусом вишни, черного перца и перца чили выпустил Кобринский маслодельно-сыродельный завод.', '2023-08-18', '2023-08-18', 7, NULL);

-- Запись 8
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (8, 'В Минске вновь пройдет гастрофест', 'Gastrofest.Craft возвращается в Минск 24 августа с «неповторимыми гастрономическими сетами, специально созданными для веселой компании», сообщили организаторы. Кормить будут едой, гармонирующей с пивом.', '2023-08-17', '2023-08-17', 8, NULL);

-- Запись 9
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (9, 'Осторожно, орангутанги за рулем!', 'Самка орангутанга из Дубая по кличке Рэмбо научилась водить электрокар и рассекает на нем по частному зверинцу. Причем, как пишет AnimaliaDubai, электрокар принадлежит самой Рэмбо.', '2023-08-17', '2023-08-17', 9, NULL);

-- Запись 10
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (10, 'Новая форма для школьных поваров.', 'Концерн «Беллегпром» 18 августа показал форму, в которую облачат школьных поваров столицы. Дизайн разработан Центром моды. Спецодежду получат не только повара, но и другие работники школьного пищеблока: буфетчики, мойщики посуды, заведующие производством.', '2023-08-14', '2023-08-14', 10, NULL);

-- Запись 11
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (11, 'Новый вид доисторического человека.', 'Антропологи из Китая и Испании впервые провели детальный морфологический анализ черепа доисторического человека возрастом 300 тысяч лет, который нашли в восточно-китайской пещере Хуалун в 2015 году. Результаты, опубликованные в издании Journal of Human Evolution, показали, что он отличается от всех когда-либо найденных останков гоминидов. Возможно, речь идет об открытии ранее неизвестной эволюционной линии людей.', '2023-08-11', '2023-08-11', 11, NULL);

-- Запись 12
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (12, 'Последствия потепления Атлантического океана', 'Атлантический океан потеплел, и теперь в США ожидают сезон сильнейших ураганов. Ученые Национального управления океанических и атмосферных исследований США (NOAA) прогнозируют 60% вероятность возникновения мощных ураганов в нынешнем году, сообщает телеканал CNBC. Предыдущая оценка вероятности была на уровне 30%.', '2023-08-10', '2023-08-10', 12, NULL);

-- Запись 13
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (13, 'В Россонском районе аист запутался в дереве.', 'В деревне Кресты Россонского района в четверг случилось необычное ЧП: аист застрял в кроне дерева, запутавшись в ветвях высоко над землей, сообщает МЧС.', '2023-08-17', '2023-08-17', 13, NULL);

-- Запись 14
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (14, 'Водитель завода четыре года воровал глазированные сырки.', 'Минчанин пять лет работал на заводе водителем и большую часть этого времени забирал себе под видом неликвида творог, глазированные сырки и прочую продукцию, которая должна была попасть на полки столичных магазинов. Теперь его будут судить за присвоение имущества', '2023-08-17', '2023-08-17', 14, NULL);

-- Запись 15
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (15, 'Новое открытие ученых.', 'Многие фитнес-трекеры и приложения говорят нам, что для поддержания здоровья человеку нужно проходить 10 тысяч шагов в день. Но ученые выяснили: хватит и меньшего количества - от 2 до 4 тысяч.', '2023-08-17', '2023-08-17', 15, NULL);

-- Запись 16
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (16, 'Пробежка длиной пять лет', 'Россиянин Руслан Шакин пробежал вокруг света, преодолев 6 континентов и 18 стран. Путь длиной в 40 075 километров — равный длине экватора — занял у него почти пять лет.', '2023-08-17', '2023-08-17', 16, NULL);

-- Запись 17
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (17, ' «Роскосмос» потерял космический аппарат «Луна».', 'В субботу, 19 августа около 14.57 связь с «Луна-25» прервалась. Вчера и сегодня аппарат искали и пытались связаться с ним, однако эти мероприятия результатов не принесли. Согласно предварительным анализам, из-за отклонения фактических параметров импульса от расчетных, аппарат перешел на нерасчетную орбиту, столкнулся с поверхностью Луны и разбился.', '2023-08-17', '2023-08-17', 17, NULL);

-- Запись 18
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (18, 'Самая полезная функция в новой iOS', 'В новой iOS появится функция, которая умеет определять вашего питомца на фото и выгружать их в отдельную папку', '2023-08-17', '2023-08-17', 18, NULL);

-- Запись 19
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (19, '200 тонн костей и плоти', 'Ученые-палеонтологи нашли кандидата в самые тяжелые животные из когда-либо живших на Земле. Это вымерший миллионы лет назад вид китов, которые могли весить около двухсот тонн — или даже до трехсот.', '2023-08-17', '2023-08-17', 19, NULL);

-- Запись 20
INSERT INTO News (id, title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (20, 'Мемный пес Чимс (настоящая кличка Болци) умер 18 августа.', 'Собаке из Гонконга по кличке Болци было 12 лет. Его хозяева ранее сообщали, что собака серьезно болела. «Не грустите, пожалуйста, помните о той радости, которую принес миру Болци. Сиба-ину с круглым улыбающимся лицом, объединяющим вас и меня, он помог многим людям во время пандемии и принес много радости многим из вас, теперь его миссия выполнена», — написал его хозяин на странице пса.', '2023-08-18', '2023-08-18', 20, NULL);
--------------------------------------------------------------------------
INSERT INTO comments (text, inserted_by_id, id_news)
VALUES
    ('Пива в Германии на всех хватает!', 1, 1),
    ('Бедные животные :(', 2, 1),
    ('Жалко и енотов, и домашних животных.', 3, 1),
    ('Как они пробираются в квартиры?', 4, 1),
    ('Не знала, что в Германии так много енотов.', 5, 1),
    ('Какие необычные новости!', 6, 1),
    ('А они разве не фрукты едят?', 7, 1),
    ('У нас бродячие коты, а у них еноты!!!', 8, 1),
    ('Нужно запирать мусорные баки и проблем таких не будет.', 9, 1),
    ('Избавиться от них всех не получится.', 10, 1),
    ('А кто хочет им делиться?', 1, 2),
    ('Обычная майка, только с логотипом McDonald''s.', 2, 2),
    ('Выглядит довольно стильно.', 3, 2),
    ('Заберите мои деньги!!!', 4, 2),
    ('Проблем нет, если и друзей нет.', 5, 2),
    ('Как раз для меня, ненавижу с кем-то делиться.', 6, 2),
    ('Прикольно.', 7, 2),
    ('Мне срочно нужна эта футболка!', 8, 2),
    ('Ну как-то не очень, слишком обычно.', 9, 2),
    ('Не купила бы.', 10, 2),
    ('Космос одновременно пугает и завораживает!', 10, 2),
    ('Наконец-то мир узнает, как выглядит Луна...', 1, 3),
    ('Вот это открытие!', 2, 3),
    ('Может когда-нибудь там найдут воду.', 3, 3),
    ('Какие хорошие новости :)', 4, 3),
    ('Что интересного в этом кратере?', 5, 3),
    ('Ждем новостей об инопланетянах.', 6, 3),
    ('Мой телефон лучше фотографирует!', 7, 3),
    ('Это большой шаг в исследовании космоса.', 8, 3),
    ('Как интересно!', 9, 3),
    ('Ну вот, еще одно доказательство того, что климат меняется и наша планета греется все больше и больше.', 10, 3),
    ('Это же ужасно! Надеюсь, что местные жители и туристы принимают все необходимые меры для защиты от жары.', 1, 4),
    ('Вот это да! Я всегда думал, что самый жаркий регион в мире находится в Африке.', 2, 4),
    ('Не могу даже представить, какой это адский зной.', 3, 4),
    ('Не могу дождаться, чтобы лето закончилось и началась прохладная осень.', 4, 4),
    ('Надеюсь, что это не повлияет на качество урожая в этом районе.', 5, 4),
    ('Кондиционеры в помощь.', 6, 4),
    ('Нужно более серьезно относиться к проблемам изменения климата...', 7, 4),
    ('Зато можно пожарить яичницу на асфальте.', 8, 4),
    ('По ощущениям у меня в городе такая же температура.', 9, 4),
    ('Какой прорыв в медицине! Надеюсь, это поможет многим людям, нуждающимся в трансплантации почек.', 10, 5),
    ('Я надеюсь, что эти генетически модифицированные органы не вызовут отторжения у пациентов в будущем.', 2, 5),
    ('Надеюсь, что эта технология будет доступна для большего числа людей и не будет слишком дорогой.', 3, 5),
    ('Это отличный пример того, как наука может помочь людям и спасти их жизни.', 4, 5),
    ('Я надеюсь, что этот метод будет использоваться только в крайних случаях, когда других способов лечения нет.', 5, 5),
    ('Мне интересно, какие еще животные могут быть использованы для создания генетически модифицированных органов.', 6, 5),
    ('Я надеюсь, что эта технология будет дополнительно проверена и протестирована, прежде чем она станет широко распространенной.', 7, 5),
    ('Это замечательно, что наука продолжает развиваться и находить новые способы лечения.', 8, 5),
    ('Я надеюсь, что этот прорыв поможет уменьшить длительность ожидания на трансплантацию почек и спасет многие жизни.', 9, 5),
    ('Это также может быть шагом к созданию более эффективных и безопасных методов лечения других заболеваний.', 10, 5);






