-- Запись 1
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Полосатые преступники', 'Пьяные еноты в Германии поедают домашних животных забираясь в чужие квартиры.', '2023-08-16', '2023-08-16', 1, 1);

-- Запись 2
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Майки для жадных в Португалии', 'McDonald’s в Португалии запустил линию футболок для тех, кто не хочет делиться мороженым Макфлури с друзьями.', '2023-08-17', '2023-08-17', 2, 2);

-- Запись 3
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Станция "Луна-25" сделала первый снимок поверхности спутника Земли.', 'Автоматическая станция, совершающая полёт по круговой орбите искусственного спутника Луны, провела съемку лунной поверхности телевизионными камерами комплекса СТС-Л.', '2023-08-17', '2023-08-17', 3, NULL);

-- Запись 4
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Новый температурный рекорд', 'В Турции в провинции Эскишехир зафиксировали новый температурный рекорд — воздух прогрелся почти до +49,5 градусов', '2023-08-16', '2023-08-16', 4, 4);

-- Запись 5
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Пересаженные человеку почки свиньи прижились и впервые нормально функционируют', 'Ученым из Университета Алабамы удалось провести успешную операцию по замене обеих почек человека генетически модифицированными органами свиньи', '2023-08-17', '2023-08-17', 5, NULL);

-- Запись 6
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Колонизаторы окрестностей Минска', 'Медведей недавно вновь видели недалеко от Минска. На этот раз в деревнях Марьяливо и Боровляны.', '2023-08-17', '2023-08-17', 6, 6);

-- Запись 7
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Необычное мороженое из Кобрина', 'Шоколадное мороженое «Любимый Брест» со вкусом вишни, черного перца и перца чили выпустил Кобринский маслодельно-сыродельный завод.', '2023-08-18', '2023-08-18', 7, NULL);

-- Запись 8
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('В Минске вновь пройдет гастрофест', 'Gastrofest.Craft возвращается в Минск 24 августа с «неповторимыми гастрономическими сетами, специально созданными для веселой компании», сообщили организаторы. Кормить будут едой, гармонирующей с пивом.', '2023-08-17', '2023-08-17', 8, NULL);

-- Запись 9
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Осторожно, орангутанги за рулем!', 'Самка орангутанга из Дубая по кличке Рэмбо научилась водить электрокар и рассекает на нем по частному зверинцу. Причем, как пишет AnimaliaDubai, электрокар принадлежит самой Рэмбо.', '2023-08-17', '2023-08-17', 9, NULL);

-- Запись 10
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Новая форма для школьных поваров.', 'Концерн «Беллегпром» 18 августа показал форму, в которую облачат школьных поваров столицы. Дизайн разработан Центром моды. Спецодежду получат не только повара, но и другие работники школьного пищеблока: буфетчики, мойщики посуды, заведующие производством.', '2023-08-14', '2023-08-14', 10, NULL);

-- Запись 11
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Новый вид доисторического человека.', 'Антропологи из Китая и Испании впервые провели детальный морфологический анализ черепа доисторического человека возрастом 300 тысяч лет, который нашли в восточно-китайской пещере Хуалун в 2015 году. Результаты, опубликованные в издании Journal of Human Evolution, показали, что он отличается от всех когда-либо найденных останков гоминидов. Возможно, речь идет об открытии ранее неизвестной эволюционной линии людей.', '2023-08-11', '2023-08-11', 11, NULL);

-- Запись 12
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Последствия потепления Атлантического океана', 'Атлантический океан потеплел, и теперь в США ожидают сезон сильнейших ураганов. Ученые Национального управления океанических и атмосферных исследований США (NOAA) прогнозируют 60% вероятность возникновения мощных ураганов в нынешнем году, сообщает телеканал CNBC. Предыдущая оценка вероятности была на уровне 30%.', '2023-08-10', '2023-08-10', 12, NULL);

-- Запись 13
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('В Россонском районе аист запутался в дереве.', 'В деревне Кресты Россонского района в четверг случилось необычное ЧП: аист застрял в кроне дерева, запутавшись в ветвях высоко над землей, сообщает МЧС.', '2023-08-17', '2023-08-17', 13, NULL);

-- Запись 14
INSERT INTO News (title, text, inserted_by_id, updated_by_id)
VALUES ('Водитель завода четыре года воровал глазированные сырки.', 'Минчанин пять лет работал на заводе водителем и большую часть этого времени забирал себе под видом неликвида творог, глазированные сырки и прочую продукцию, которая должна была попасть на полки столичных магазинов. Теперь его будут судить за присвоение имущества', 14, NULL);

-- Запись 15
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Новое открытие ученых.', 'Многие фитнес-трекеры и приложения говорят нам, что для поддержания здоровья человеку нужно проходить 10 тысяч шагов в день. Но ученые выяснили: хватит и меньшего количества - от 2 до 4 тысяч.', '2023-08-17', '2023-08-17', 15, NULL);

-- Запись 16
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Пробежка длиной пять лет', 'Россиянин Руслан Шакин пробежал вокруг света, преодолев 6 континентов и 18 стран. Путь длиной в 40 075 километров — равный длине экватора — занял у него почти пять лет.', '2023-08-17', '2023-08-17', 16, NULL);

-- Запись 17
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES (' «Роскосмос» потерял космический аппарат «Луна».', 'В субботу, 19 августа около 14.57 связь с «Луна-25» прервалась. Вчера и сегодня аппарат искали и пытались связаться с ним, однако эти мероприятия результатов не принесли. Согласно предварительным анализам, из-за отклонения фактических параметров импульса от расчетных, аппарат перешел на нерасчетную орбиту, столкнулся с поверхностью Луны и разбился.', '2023-08-17', '2023-08-17', 17, NULL);

-- Запись 18
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Самая полезная функция в новой iOS', 'В новой iOS появится функция, которая умеет определять вашего питомца на фото и выгружать их в отдельную папку', '2023-08-17', '2023-08-17', 18, NULL);

-- Запись 19
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('200 тонн костей и плоти', 'Ученые-палеонтологи нашли кандидата в самые тяжелые животные из когда-либо живших на Земле. Это вымерший миллионы лет назад вид китов, которые могли весить около двухсот тонн — или даже до трехсот.', '2023-08-17', '2023-08-17', 19, NULL);

-- Запись 20
INSERT INTO News (title, text, creation_date, last_edit_date, inserted_by_id, updated_by_id)
VALUES ('Мемный пес Чимс (настоящая кличка Болци) умер 18 августа.', 'Собаке из Гонконга по кличке Болци было 12 лет. Его хозяева ранее сообщали, что собака серьезно болела. «Не грустите, пожалуйста, помните о той радости, которую принес миру Болци. Сиба-ину с круглым улыбающимся лицом, объединяющим вас и меня, он помог многим людям во время пандемии и принес много радости многим из вас, теперь его миссия выполнена», — написал его хозяин на странице пса.', '2023-08-18', '2023-08-18', 20, NULL);
--------------------------------------------------------------------------

INSERT INTO comments (text, inserted_by_id, id_news,creation_date,last_edit_date)
VALUES
    ('Пива в Германии на всех хватает!', 1, 1,null,null),
    ('Бедные животные :(', 2, 1,null,null),
    ('Жалко и енотов, и домашних животных.', 3, 1,null,null),
    ('Как они пробираются в квартиры?', 4, 1,null,null),
    ('Не знала, что в Германии так много енотов.', 5, 1,null,null),
    ('Какие необычные новости!', 6, 1,null,null),
    ('А они разве не фрукты едят?', 7, 1,null,null),
    ('У нас бродячие коты, а у них еноты!!!', 8, 1,null,null),
    ('Нужно запирать мусорные баки и проблем таких не будет.', 9, 1,null,null),
    ('Избавиться от них всех не получится.', 10, 1,null,null),
    ('А кто хочет им делиться?', 1, 2,null,null),
    ('Обычная майка, только с логотипом McDonald''s.', 2, 2,null,null),
    ('Выглядит довольно стильно.', 3, 2,null,null),
    ('Заберите мои деньги!!!', 4, 2,null,null),
    ('Проблем нет, если и друзей нет.', 5, 2,null,null),
    ('Как раз для меня, ненавижу с кем-то делиться.', 6, 2,null,null),
    ('Прикольно.', 7, 2,null,null),
    ('Мне срочно нужна эта футболка!', 8, 2,null,null),
    ('Ну как-то не очень, слишком обычно.', 9, 2,null,null),
    ('Не купила бы.', 10, 2,null,null),
    ('Космос одновременно пугает и завораживает!', 10, 2,null,null),
    ('Наконец-то мир узнает, как выглядит Луна...', 1, 3,null,null),
    ('Вот это открытие!', 2, 3,null,null),
    ('Может когда-нибудь там найдут воду.', 3, 3,null,null),
    ('Какие хорошие новости :,null,null)', 4, 3,null,null),
    ('Что интересного в этом кратере?', 5, 3,null,null),
    ('Ждем новостей об инопланетянах.', 6, 3,null,null),
    ('Мой телефон лучше фотографирует!', 7, 3,null,null),
    ('Это большой шаг в исследовании космоса.', 8, 3,null,null),
    ('Как интересно!', 9, 3,null,null),
    ('Ну вот, еще одно доказательство того, что климат меняется и наша планета греется все больше и больше.', 10, 3,null,null),
    ('Это же ужасно! Надеюсь, что местные жители и туристы принимают все необходимые меры для защиты от жары.', 1, 4,null,null),
    ('Вот это да! Я всегда думал, что самый жаркий регион в мире находится в Африке.', 2, 4,null,null),
    ('Не могу даже представить, какой это адский зной.', 3, 4,null,null),
    ('Не могу дождаться, чтобы лето закончилось и началась прохладная осень.', 4, 4,null,null),
    ('Надеюсь, что это не повлияет на качество урожая в этом районе.', 5, 4,null,null),
    ('Кондиционеры в помощь.', 6, 4,null,null),
    ('Нужно более серьезно относиться к проблемам изменения климата...', 7, 4,null,null),
    ('Зато можно пожарить яичницу на асфальте.', 8, 4,null,null),
    ('По ощущениям у меня в городе такая же температура.', 9, 4,null,null),
    ('Какой прорыв в медицине! Надеюсь, это поможет многим людям, нуждающимся в трансплантации почек.', 10, 5,null,null),
    ('Я надеюсь, что эти генетически модифицированные органы не вызовут отторжения у пациентов в будущем.', 2, 5,null,null),
    ('Надеюсь, что эта технология будет доступна для большего числа людей и не будет слишком дорогой.', 3, 5,null,null),
    ('Это отличный пример того, как наука может помочь людям и спасти их жизни.', 4, 5,null,null),
    ('Я надеюсь, что этот метод будет использоваться только в крайних случаях, когда других способов лечения нет.', 5, 5,null,null),
    ('Мне интересно, какие еще животные могут быть использованы для создания генетически модифицированных органов.', 6, 5,null,null),
    ('Я надеюсь, что эта технология будет дополнительно проверена и протестирована, прежде чем она станет широко распространенной.', 7, 5,null,null),
    ('Это замечательно, что наука продолжает развиваться и находить новые способы лечения.', 8, 5,null,null),
    ('Я надеюсь, что этот прорыв поможет уменьшить длительность ожидания на трансплантацию почек и спасет многие жизни.', 9, 5,null,null),
    ('Это также может быть шагом к созданию более эффективных и безопасных методов лечения других заболеваний.', 10, 5,null,null),
    ('Будьте осторожны, если вы отправляетесь в лес на грибы или ягоды.', 1, 6,null,null),
        ('Какой красивый зверь! Хочется увидеть его вживую.', 2, 6,null,null),
        ('Может быть, это связано с изменением климата?', 3, 6,null,null),
        ('Думаю, что нужно обратиться к экспертам по охране дикой природы, чтобы понять, как правильно вести себя в такой ситуации.', 4, 6,null,null),
        ('Медведи могут быть опасными, но если вы будете соблюдать правила безопасности, то все будет хорошо.', 5, 6,null,null),
        ('Может быть, это хороший повод для туристической индустрии развивать экотуризм?', 6, 6,null,null),
        ('Медведи - это часть нашего культурного наследия, и мы должны сохранять их для будущих поколений.', 7, 6,null,null),
        ('Медведи - это часть природы, и мы должны уважать их территорию.', 8, 6,null,null),
        ('Надеюсь, что люди будут соблюдать осторожность и не подходить к медведям близко.', 9, 6,null,null),
        ('Это так здорово, что животные возвращаются в наши леса!', 10, 6,null,null),
        ('Это интересный эксперимент со вкусами, но я бы предпочел более традиционные вкусы мороженого.', 1, 7,null,null),
        ('Никогда не пробовал такой необычный вкус, но хочу!', 2, 7,null,null),
        ('Вишня и перец чили - это слишком экстремально для меня.', 3, 7,null,null),
        ('Мне понравилось, что производители решили попробовать что-то новое и необычное.', 4, 7,null,null),
        ('Если бы они добавили еще больше перца, то было бы идеально для меня!', 5, 7,null,null),
        ('Не могу представить, как это может быть вкусно.', 6, 7,null,null),
        ('Может быть, стоит попробовать сделать более мягкий вариант этого мороженого для тех, кто не любит остроту?', 7, 7,null,null),
        ('Очень интересный вкус, но я бы не стал его покупать снова.', 8, 7,null,null),
        ('Я думаю, что такие эксперименты с вкусами мороженого помогают привлечь новых покупателей.', 9, 7,null,null),
        ('Мне нравится, что можно попробовать что-то новое и необычное, но я всегда буду предпочитать классические вкусы.', 10, 7,null,null),
        ('Я бы хотел попробовать эти гастрономические сеты, они, наверняка, очень интересные и необычные.', 1, 8,null,null),
        ('Комбинация еды и пива звучит заманчиво, я думаю, что это будет отличный опыт для всех участников гастрофеста.', 2, 8,null,null),
        ('Как интересно! Я обязательно посещу этот гастрофест и попробую эти гастрономические сеты.', 3, 8,null,null),
        ('Я люблю гастрономические мероприятия, и этот гастрофест обещает быть очень интересным.', 4, 8,null,null),
        ('Будет здорово попробовать новые сочетания еды и пива, которые специально созданы для этого мероприятия.', 5, 8,null,null),
        ('Я уже давно хотел попробовать крафт-пиво, произведенное в России, так что это отличный повод для этого.', 6, 8,null,null),
        ('Надеюсь, что на гастрофесте будут представлены блюда разных кухонь, чтобы можно было попробовать что-то новое.', 7, 8,null,null),
        ('Я уверен, что это мероприятие привлечет множество людей.', 8, 8,null,null),
        ('Жду с нетерпением начала гастрофеста и надеюсь, что это будет незабываемый опыт для всех участников.', 9, 8,null,null),
        ('Я рад, что такие мероприятия проводятся в нашем городе, это поднимает культурный уровень и добавляет разнообразия в повседневную жизнь.', 10, 8,null,null),
        ('Какая удивительная новость! Орангутанги - удивительные создания, и я рада, что Рэмбо научилась водить электрокар.', 1, 9,null,null),
        ('Это просто потрясающе! Я никогда не думал, что животные могут научиться водить автомобиль.', 2, 9,null,null),
        ('Вот это да! Кто бы мог подумать, что орангутанги могут быть настолько умными и талантливыми.', 3, 9,null,null),
        ('Это доказывает, что животные могут научиться очень многому, если мы дадим им возможность.', 4, 9,null,null),
        ('Это очень забавно и интересно! Я бы хотел увидеть Рэмбо за рулем электрокара.', 5, 9,null,null),
        ('Я уверен, что Рэмбо - не единственный орангутан с такими талантами.', 6, 9,null,null),
        ('Может быть, другие животные тоже могут научиться водить автомобиль?', 7, 9,null,null),
        ('Это прекрасный пример того, как животные могут адаптироваться к новым условиям и использовать новые технологии.', 8, 9,null,null),
        ('Это очень важно, чтобы мы продолжали исследовать и изучать возможности животных и их интеллектуальные способности.', 9, 9,null,null),
        ('Я надеюсь, что такие новости станут более распространенными, чтобы люди осознали, насколько умны и способны животные.', 10, 9,null,null),
        ('Какой красивый дизайн формы!', 1, 10,null,null),
        ('Я думаю, что такая форма поможет создать единую корпоративную культуру и подчеркнуть важность роли поваров в образовательной системе.', 2, 10,null,null),
        ('Это очень важно, чтобы школьные повара выглядели профессионально и чисто.', 3, 10,null,null),
        ('Я надеюсь, что такая спецодежда будет удобной и функциональной, чтобы повара могли работать в ней в течение всего дня.', 4, 10,null,null),
        ('Это отличный пример того, как компании могут заботиться о своих сотрудниках и создавать благоприятные условия для работы.', 5, 10,null,null),
        ('Я думаю, что такая форма поможет повысить уровень гигиены на производстве.', 6, 10,null,null),
        ('Это замечательно, что не только повара, но и другие работники школьного пищеблока получат спецодежду.', 7, 10,null,null),
        ('Я уверен, что такая форма поможет создать единство и дух коллектива среди работников школьного пищеблока.', 8, 10,null,null),
        ('Я надеюсь, что такая форма будет стимулировать работников школьного пищеблока к большей ответственности и профессионализму.', 9, 10,null,null),
        ('Я надеюсь, что такая форма станет образцом для других компаний и поможет повысить уровень профессионализма и качества обслуживания в сфере питания.', 10, 10,null,null),
        ('Это удивительно, что ученые смогли провести такой детальный анализ черепа доисторического человека.', 1, 11,null,null),
        ('Это открытие может помочь лучше понять происхождение и развитие человека.', 2, 11,null,null),
        ('Интересно, какие еще открытия ждут нас в будущем в области антропологии', 3, 11,null,null),
        ('Это отличный пример того, как междисциплинарные исследования могут привести к важным открытиям.', 4, 11,null,null),
        ('Я уверен, что это открытие вызовет большой интерес ученых по всему миру.', 5, 11,null,null),
        ('Это напоминает о том, как мало мы знаем о прошлом и как много еще предстоит изучить.', 6, 11,null,null),
        ('Интересно, какие новые технологии и методы исследования помогут нам узнать больше о нашем прошлом.', 7, 11,null,null),
        ('Это открытие может помочь сформировать новые гипотезы и теории о происхождении человека.', 8, 11,null,null),
        ('Я надеюсь, что это открытие станет отправной точкой для дальнейших исследований в области антропологии.', 9, 11,null,null),
        ('Это напоминает о том, как важно продолжать исследования и расширять наши знания о мире, в котором мы живем.', 10, 11,null,null),
        ('Это очень тревожно, что потепление океана может привести к усилению ураганов в США.', 1, 12,null,null),
        ('Нам нужно принимать более серьезные меры для борьбы с изменением климата и сохранения нашей планеты.', 2, 12,null,null),
        ('Надеюсь, что люди начнут осознавать важность экологической ответственности и будут делать все возможное для сохранения окружающей среды.', 3, 12,null,null),
        ('Это еще один пример того, как наши действия могут повлиять на природу и жизнь людей.', 4, 12,null,null),
        ('Нам нужно обратить больше внимания на исследования климатических изменений и разработку новых технологий для борьбы с этой проблемой.', 5, 12,null,null),
        ('Это напоминает о том, что мы все живем на одной планете и должны работать вместе для ее сохранения.', 6, 12,null,null),
        ('Надеюсь, что правительство США и другие страны будут принимать более серьезные меры для борьбы с изменением климата.', 7, 12,null,null),
        ('Это также может повлиять на экономику США и других стран, которые могут столкнуться с большими экономическими потерями из-за ураганов.', 8, 12,null,null),
        ('Нам нужно улучшать нашу систему предупреждения и защиты от ураганов, чтобы минимизировать потери жизней и имущества.', 9, 12,null,null),
        ('Нам нужно улучшать нашу инфраструктуру, чтобы она могла выдерживать сильные ураганы и другие природные бедствия.', 10, 12,null,null),
        ('Какой же милый этот аист!', 1, 13,null,null),
        ('Это так здорово, что МЧС быстро отреагировали на ситуацию.', 2, 13,null,null),
        ('Наверняка жители деревни были очень обеспокоены.', 3, 13,null,null),
        ('Надеюсь, что аист не получил серьезных травм.', 4, 13,null,null),
        ('Может быть, аист попал в ловушку из-за нашего вмешательства в природу?', 5, 13,null,null),
        ('Нужно больше внимания уделять охране животных и их среды обитания.', 6, 13,null,null),
        ('Надеюсь, что аист сможет скоро вернуться к своей жизни на свободе.', 7, 13,null,null),
        ('Это так здорово, что люди готовы помочь животным в беде.', 8, 13,null,null),
        ('Нам нужно больше таких историй о спасении животных.', 9, 13,null,null),
        ('Это очень трогательная история, которая напоминает нам о том, как много добра есть в мире.', 10, 13,null,null),
        ('Это ужасно, что человек присваивал имущество, которое должно было попасть на полки магазинов.', 1, 14,null,null),
        ('Как можно было так долго продолжать кражу и не бояться наказания', 2, 14,null,null),
        ('Надеюсь, что этот случай станет примером для других и поможет предотвратить подобные ситуации в будущем.', 3, 14,null,null),
        ('Жаль, что такие люди портят репутацию честных работников.', 4, 14,null,null),
        ('Хорошо, что его поймали и теперь он будет отвечать за свои действия.', 5, 14,null,null),
        ('Это еще раз подчеркивает важность контроля и бдительности на производстве.', 6, 14,null,null),
        ('Может быть, это была необходимость, чтобы прокормить свою семью, но это не оправдывает его действия.', 7, 14,null,null),
        ('Неужели он не думал о последствиях своих действий?', 8, 14,null,null),
        ('Это еще раз напоминает о том, как важно следовать правилам и законам.', 9, 14,null,null),
        ('Надеюсь, что суд вынесет справедливый приговор.', 10, 14,null,null),
        ('Наконец-то наука дала ответ на вопрос, сколько шагов в день нужно делать для здоровья.', 1, 15,null,null),
        ('Это может помочь людям, которые не могут себе позволить ходить 10 тысяч шагов в день, но все же хотят заботиться о своем здоровье.', 2, 15,null,null),
        ('Надеюсь, что эта информация будет распространяться широко и поможет людям стать более активными и здоровыми.', 3, 15,null,null),
        ('Может быть, это станет стимулом для людей начать заниматься спортом или просто больше двигаться в повседневной жизни.', 4, 15,null,null),
        ('Это еще раз подчеркивает важность научных исследований в области здоровья и физической активности.', 5, 15,null,null),
        ('Надеюсь, что люди не будут перегружать себя и продолжать увеличивать количество шагов в день до 10 тысяч, если это необходимо.', 6, 15,null,null),
        ('Может быть, это станет причиной для производителей фитнес-трекеров и приложений пересмотреть свои рекомендации.', 7, 15,null,null),
        ('Это еще раз напоминает нам о том, что забота о своем здоровье - это постоянный процесс, а не временный тренд.', 8, 15,null,null),
        ('Хорошая новость для меня!', 9, 15,null,null),
        ('По-моему 10 тысяч шагов не так уж и много.', 10, 15,null,null),
        ('Невероятно вдохновляющая история! Шакин - настоящий герой.', 1, 16,null,null),
        ('Какой же он сильный и выносливый!', 2, 16,null,null),
        ('Пробежать весь мир - это нешуточное достижение.', 3, 16,null,null),
        ('Мне кажется, что такие люди могут вдохновить на изменение своей жизни и преодоление трудностей.', 4, 16,null,null),
        ('Хотелось бы почитать подробнее о том, как Шакин находил еду на местных рынках в разных странах.', 5, 16,null,null),
        ('Мне кажется, что такие люди, как Шакин, могут стать примером для молодежи и мотивировать их на достижение своих целей.', 6, 16,null,null),
        ('Невероятно круто, что он смог сделать это без поддержки команды или автомобиля-сопровождения!', 7, 16,null,null),
        ('Это действительно впечатляет.', 8, 16,null,null),
        ('Как же много Шакину пришлось пережить за время своего забега! Но он не сдался и продолжал двигаться вперед.', 9, 16,null,null),
        ('Мне кажется, что такие люди могут внести огромный вклад в развитие спорта и туризма.', 10, 16,null,null),
        ('Как жаль, что такое произошло!', 1, 17,null,null),
        ('Очень жаль потерять такой дорогостоящий аппарат.', 2, 17,null,null),
        ('Это неприятно, что все усилия по поиску и восстановлению связи оказались безрезультатными.', 3, 17,null,null),
        ('Надеюсь, что ученые смогут извлечь хотя бы какие-то данные из аппарата, чтобы не все было потеряно.', 4, 17,null,null),
        ('Это напоминает о том, как важно тщательно проверять и тестировать оборудование перед запуском.', 5, 17,null,null),
        ('Как же много усилий и ресурсов было вложено в этот проект, и как жаль, что он закончился таким образом.', 6, 17,null,null),
        ('Стоит отметить, что такие неудачи - это неизбежная часть научных исследований и экспериментов.', 7, 17,null,null),
        ('Надеюсь, что ученые смогут продолжать работу над исследованием Луны и других космических объектов.', 8, 17,null,null),
        ('Надеюсь, что ученые смогут извлечь уроки из этой неудачи и применить их в будущих проектах.', 9, 17,null,null),
        ('Жаль, что такой многообещающий проект закончился неудачей, но это не должно остановить научное развитие и исследования.', 10, 17,null,null),
        ('Это прекрасная новость для всех, кто любит делиться фотографиями своих питомцев со своими друзьями и близкими.', 1, 18,null,null),
       ('Теперь вы сможете легко и быстро находить все фотографии своего питомца в одном месте, не перебирая все свои альбомы.', 2, 18,null,null),
       ('Эта функция также может быть полезна для тех, кто утратил своего питомца, чтобы сохранить его воспоминания в одном месте.', 3, 18,null,null),
       ('Как здорово, что Apple учитывает потребности владельцев домашних животных!', 4, 18,null,null),
       ('Это будет очень удобно для тех, кто часто фотографирует своих питомцев.', 5, 18,null,null),
       ('Наконец-то не придется искать среди сотен фото на телефоне те, где изображен питомец.', 6, 18,null,null),
       ('Это еще один повод перейти на iOS.', 7, 18,null,null),
       ('Надеюсь, что определение питомца на фото будет работать точно и без ошибок.', 8, 18,null,null),
       ('Какая забавная и полезная функция! Жду с нетерпением обновления.', 9, 18,null,null),
       ('Спасибо Apple за такую интересную новинку!', 10, 18,null,null),
       ('Невероятно интересно узнать о животных, которые жили на Земле миллионы лет назад.', 1, 19,null,null),
       ('Как впечатляет вес этих китов!', 2, 19,null,null),
       ('Жаль, что таких гигантов уже не существует.', 3, 19,null,null),
       ('Представляю, как было бы страшно встретиться с такими тварями в живую.', 4, 19,null,null),
       ('Это еще раз доказывает, что наша планета полна удивительных и загадочных существ.', 5, 19,null,null),
       ('Невероятно, что эти киты могли достигать такого веса.', 6, 19,null,null),
       ('Как им удавалось поддерживать свое тело?', 7, 19,null,null),
       ('Жаль, что мы не можем увидеть их в живую, но благодаря науке мы можем представить, какие они были.', 8, 19,null,null),
       ('Спасибо ученым за их работу и за возможность узнавать все больше о нашей планете и ее прошлом.', 9, 19,null,null),
       ('Это еще раз доказывает, что мы не знаем о нашей планете и ее истории еще так много.', 10, 19,null,null),
       ('Очень жаль потерять такого замечательного пса.', 1, 20,null,null),
       ('Болци принес много радости людям, и его уход оставит пустоту в сердцах многих.', 2, 20,null,null),
       ('Надеюсь, что Болци сейчас на лучшем месте, где ему больше не нужно страдать и болеть.', 3, 20,null,null),
       ('Как жаль, что такой замечательный пес ушел из нашей жизни.', 4, 20,null,null),
       ('Это напоминает о том, как важно ценить каждый момент с любимыми питомцами и дарить им максимум любви и заботы.', 5, 20,null,null),
       ('Болци был настоящим символом добра и радости.', 6, 20,null,null),
       ('Как жаль, что такой добрый и милый пес ушел из нашей жизни.', 7, 20,null,null),
       ('Болци оставил свой след в сердцах многих людей.', 8, 20,null,null),
       ('Болци был не только питомцем, но и членом семьи.', 9, 20,null,null),
       ('Надеюсь, что мы все будем помнить Болци как символ жизнерадостности и энергии, которую он передавал всем вокруг.', 10, 20,null,null);

----------------------------------
--INSERT INTO users (username, password, name, surname, parent_name, creation_date, last_edit_date,id_role)
--VALUES ('john_doe', 'password123', 'John', 'Doe', 'Mary', '2023-08-18T12:34:56Z', '2023-08-18T12:34:56Z',null,null,1);

INSERT INTO users (username, password, name, surname, parent_name, id_role)
VALUES ('username', 'password', 'John', 'Doe', 'Parent Doe', 1);

